rest-server/src/gSoapFiles/client/CAPSoapHttp.getMessage.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:ns2="http://gov.fema.ipaws.services/caprequest"
    xmlns:ns3="http://gov.fema.ipaws.services/capresponse"
    xmlns:ns4="urn:oasis:names:tc:emergency:cap:1.2"
    xmlns:ns1="http://gov.fema.ipaws.services/IPAWS_CAPService/">
 <SOAP-ENV:Header>
  <ns1:CAPHeaderTypeDef SOAP-ENV:mustUnderstand="1">
   <ns1:logonUser xsi:type="xsd:string"></ns1:logonUser>
   <ns1:logonCogId xsi:type="xsd:int">0</ns1:logonCogId>
  </ns1:CAPHeaderTypeDef>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <ns1:getMessageTypeDef xsi:type="ns2:requestParameterList">
    <ns2:requestAPI xsi:type="xsd:string"></ns2:requestAPI>
    <ns2:requestOperation xsi:type="xsd:string"></ns2:requestOperation>
    <ns2:parameters xsi:type="ns2:parameterListItem">
     <ns2:parameterName xsi:type="xsd:string"></ns2:parameterName>
     <ns2:comparisonOp xsi:type="xsd:string"></ns2:comparisonOp>
     <ns2:parameterValue xsi:type="xsd:string"></ns2:parameterValue>
     <ns2:logicalOp xsi:type="xsd:string"></ns2:logicalOp>
    </ns2:parameters>
   </ns1:getMessageTypeDef>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
